&НаКлиенте
Процедура ПересчитатьСумму()
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;		
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;	
	СуммаИтоговая = 0;
	Для Каждого Стр Из Объект.Товары Цикл
		СуммаИтоговая = СуммаИтоговая + Стр.Сумма;
	КонецЦикла;	
	Объект.СуммаДокумента = СуммаИтоговая;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьСумму();		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры